var array = [ // всё
    [   // первый раздел
        {   // варианты ПРОЕКТЫ
            1 : 'МКС',
            2 : 'Ядерный буксир',
            3 : 'Фотонный двигатель'
        },
        {   // фото
            1 : "url('../images/slider-for-big-page/first.jpg')",
            2 : "url('../images/slider-for-big-page/second.jpg')",
            3 : "url('../images/slider-for-big-page/foton.png')"
        },
        {   // текста 
            1 : '<h1>Международная космическая станция</h1><p>Крупнейший космический аппарат, когда-либо построенный человеком. Длительное функционирование МКС стало убедительным примером эффективного международного сотрудничества в сфере освоения космического пространства. Благодаря совместным усилиям 14 стран по созданию и обеспечению деятельности постоянно обитаемой орбитальной станции она стала одним из символов нашего времени и форпостом человечества в космосе.</p><p>МКС - это логическое продолжение сегодняшнего этапа развития космонавтики. Усилиями в первую очередь советской и российской космонавтики доказана возможность длительных пилотируемых полетов, определены направления деятельности для создания внеземных производств.</p><p>Проект МКС объединяет ресурсы, научно-технические достижения и опыт западных стран и России, способствует развитию национальных экономик и эффективному использованию космоса в интересах мирового сообщества, взаимопониманию государств. Создание Международной космической станции является необходимой ступенью развития Человечества в плане использования ресурсов Земли и Солнечной системы.</p><p>В создании станции принимали участие: Россия, США, Канада, Япония, Германия, Франция, Испания, Италия, Дания, Бельгия, Нидерланды, Норвегия, Швеция и Швейцария. Реализация программы МКС была начата 20 ноября 1998 года после старта российского функционального грузового блока «Заря», который стал базовым элементом МКС. Роль России в этом проекте — одна из ведущих. Опыт, накопленный российской космонавтикой за период эксплуатации собственных пилотируемых орбитальных станций, во многом стал практической базой для создания МКС.</p> <br><br><br>',
            2 : '<h1>Ядерный буксир "Зевс" </h1><p>В дальний космос лучше лететь на корабле с ядерной энергодвигательной установкой. Такой корабль может преодолеть ограничения скорости ракет на химическом топливе. Но пока ни одна страна мира не смогла запустить такой корабль. В 2021 году Роскосмос заключил контракт с КБ «Арсенал» на разработку проекта по созданию космического комплекса с транспортно-энергетическим модулем (ТЭМ). В нём применяются ионные двигатели, которые способны добавить кораблю на порядок более высокий импульс, чем современные химические ракетные двигатели. Обычно у них очень слабая тяга, но в «Зевсе» мощным источником энергии для них станет ядерная энергетическая установка. Это позволит радикально приблизить дальний космос, сделав полёты к другим планетам Солнечной системы обычным делом. Проекты космических аппаратов с ЯЭДУ появились на заре космической эры. Но ни один из них не был реализован, так как они упирались в ряд сложных технических проблем. Хотя радиоактивный распад способен стать мощным источником энергии, тепло от него в вакууме сложно отвести. Но, дело постепенно сдвигается с мёртвой точки. В 2021 году Роскосмос заключил госконтракт с КБ «Арсенал» на разработку аванпроекта к 2025 г. и надеется отправить на основе ТЭМ, получившем название «Зевс», исследовательскую миссию к спутникам Юпитера уже в 2030 г.</p><p>Известна и первая миссия на основе ТЭМ, которая планируется уже на 2030 г., и рассчитанная на три этапа (общая длительность 50 месяцев), последним из которых станет изучение Юпитера и его спутников. Об этом рассказал глава Роскосмоса Дмитрий Рогозин на 72 международном астронавтическом конгрессе в Дубае «Если мы говорим об освоении дальних уголков Солнечной системы, то использование возможностей традиционных химических ракетных двигателей бессмысленно. Можно говорить только о ядерной энергетике в космосе…Первая экспедиция «Зевса» к ледяным лунам Юпитера планируется уже в 2030 г. По пути туда космический комплекс на его основе совершит гравитационные манёвры у Луны и Венеры, отделив там серию научных КА».</p><p>Уже известна приблизительная мощность, которая составит 470 кВт (тепловая мощность 1,9 МВт). Полная масса ТЭМ составит 22 т (из них самого энергоблока – 7 т, а компонентов топлива – около 1 т (Ксенон)). Длина ТЭМ составит 56,7 м, наибольшая ширина при развернутых панелях радиаторов 10,6 м, а развернутых панелей солнечных батарей 20,9 м (в транспортном положении габариты 24,9х5 м).</p> <br><br><br>',
            3 : '<h1>Фотонный двигатель</h1><p>Фотонный двигатель — гипотетический ракетный двигатель, где источником энергии служит тело, которое излучает свет. Фотон имеет импульс, и, соответственно, при истекании из двигателя, свет создаёт реактивную тягу. Теоретически фотонный двигатель может развить максимально возможную для реактивного двигателя тягу в пересчёте на затраченную массу космического аппарата, позволяя достигать скоростей, близких к скорости света, однако практическая разработка таких двигателей, судя по всему, дело далёкого будущего. </p><p>Создание фотонных двигателей (ФД) для исследования дальних объектов в космосе является давней мечтой человечества. Целью данной работы является исследование возможности преобразования энергии деления в ядерном реакторе в излучение для создания фотонного двигателя. Существует убеждение, что о фотонных двигателях еще рано говорить, так как для этого нужно использовать реакцию аннигиляции вещества с антивеществом, а пока фотонный двигатель на такой основе еще не изобретен. Действительно, "теплотворная способность" реакции аннигиляции является наибольшей из всех известных способов освобождения энергии. Но, используя уже достаточно освоенную реакцию деления, тоже можно получить обнадеживающие результаты изучения перспектив ФД, хотя для этого потребуется решить ряд непростых инженерно-конструкторских проблем. </p><p>Первая идея - использовать лазер с ядерной накачкой. Эта идея основана на определенных достижениях в этой области, в частности в ФЭИ. Ведь, в сущности, лазер - это уже изобретенный фотонный двигатель, создающий направленный поток фотонов. Вопрос только в его ресурсоспособности, весе, величине выгорания ядерного горючего, к.п.д. и других инженерно-физических параметрах. Анализ показывает, что на этом пути еще нужны исследования по отысканию эффективных ядерно-активных сред, значительному повышению к.п.д., разработке системы автоматического управления и решению других конструкторских проблем. Другая идея фотонного двигателя состоит в использовании бросового тепла космической ЯЭУ с помощью секций холодильника-излучателя, выполненных в виде параболических зеркал для инфракрасного излучения. Здесь есть свои проблемы (материал для зеркал, работающий при высокой температуре), режимы работы для САУ и других узлов ЯЭУ, конструкция секций параболических зеркал с большой поверхностью. Здесь также большую роль играет инерция - как механическая, так и тепловая для холодильника-излучателя. </p> <br><br><br>'
        }
    ],
    [   // второй раздел
        {   // варианты МИССИИ
            1 : 'Покорение Марса',
            2 : 'Лунная миссия',
            3 : 'третий вариант - новый'
        },
        {   // фото
            1 : "url('../images/slider-for-big-page/second_new.jpeg')",
            2 : "url('../images/slider-for-big-page/first_new.jpg')",
            3 : "url('../images/slider-for-big-page/third_new.png')"
        },
        {   // текста 
            1 : 'первый вариант 2',
            2 : 'второй вариант 2',
            3 : 'третий вариант 2'
        }
    ],
    [   // третий раздел
        {   // варианты
            1 : 'первый вариант - совсем новый',
            2 : 'второй вариант - совсем новый',
            3 : 'третий вариант - совсем новый'
        },
        {   // фото
            1 : "url('../images/slider-for-big-page/first.jpeg')",
            2 : "url('../images/slider-for-big-page/first_new.jpg')",
            3 : "url('../images/slider-for-big-page/third_new.png')"
        },
        {   // текста 
            1 : 'первый вариант 3',
            2 : 'второй вариант 3',
            3 : 'третий вариант 3'
        }
    ]
]

var variants = document.querySelectorAll('.variants li'); // кнопки вариантов
var disc = document.querySelector('.discription_photo'); // блок описания

var rev = function(arg) { // аргумент - номер раздела
// переключение вариантов 
var i = 0;
    for (variant of variants) {
        i++
        variant.innerHTML = array[arg][0][i];
        document.body.style.backgroundImage = array[arg][1][1]; // по переходу на новый раздел открывается первая картинка
        disc.innerHTML = array[arg][2][1]; // по переходу на новый раздел открывается первое описание
    }


// переключение фоток
    for (variant of variants) {
        variant.onclick = function() {
            document.body.style.backgroundImage = array[arg][1][this.value]; // value - номер картинки
            // изменение описания
            disc.innerHTML = array[arg][2][this.value]
        }
    }
}

rev(0);